{
  "level": {
    "_id": "6268de6cb055e86ede854aed",
    "name": "Social Engineering und Phishing",
    "token": "level10",
    "description": "Die Authentifizierung eines Nutzers anhand seines Nutzernamens und eines geheimen Passworts ist ein sehr geläufiges Verfahren. Viele Angriffe auf solche Verfahren konzentrieren sich darauf, das Passwort und auch ggf. den Nutzernamen zu erraten. \nPhishing basiert auf Social Engineering und nutzt das Vertrauen von Personen in die Sicherheit von als vertrauenswürdig geltenden Markennamen.",
    "events": {
      "0": {
        "_id": "6268dd8cb055e86ede854ae7",
        "name": "event1",
        "text": [
          "Ihr Betrieb bekommt am Wochenende neue Arbeitsgeräte. Während Sie am Optimieren der Sicherheitssteuerung für die von Ihrem Team betreuten Anlage arbeiten, haben Sie eine E-Mail von Ihrem Abteilungsleiter erhalten, in der er Sie darum bittet, Ihre private Handynummer zu aktualisieren, da Sie über das Wochenende erreichbar sein sollten."
        ],
        "levelId": "6268de6cb055e86ede854aed",
        "cards": [
          {
            "_id": "6268dd64b055e86ede854ae4",
            "name": "card1",
            "text": [
              "E-Mail löschen und ignorieren"
            ],
            "points": 2,
            "nextEvent": 3,
            "nextImage": "download",
            "nextEventText": 4,
            "image": "deleted",
            "feedback": "Richtige Entscheidung, jedoch sollte auch die Sicherheitsabteilung informiert werden, damit ggf. auch alle anderen Mitarbeiter über den Vedacht informiert werden"
          },
          {
            "_id": "6268de98b055e86ede854af1",
            "name": "card3",
            "text": [
              "Auf die E-Mail antworten und fragen, ob das eine Pflicht für alle Mitarbeiterinnen und Mitarbeiter ist"
            ],
            "points": -1,
            "nextEvent": 2,
            "nextImage": "login",
            "nextEventText": 0,
            "image": "email",
            "feedback": "Auf eine Phishing Mail sollte nicht geantwortet werden. Dadurch wird dem Angreifer bestätigt, dass die Mail angekommen ist"
          },
          {
            "_id": "6268deb1b055e86ede854af2",
            "name": "card4",
            "text": [
              "Mit der zuständigen Sicherheitsabteilung kontakt aufnehmen"
            ],
            "points": 4,
            "nextEvent": 3,
            "nextImage": "download",
            "nextEventText": 3,
            "image": "humanInterface",
            "feedback": "Kontaktaufnahme mit der Sicherheitsabteilung bei einem Verdacht ist eine gute Lösung"
          },
          {
            "_id": "6268de81b055e86ede854af0",
            "name": "card2",
            "text": [
              "Link öffnen, um die aktuelle Handy-/Telefonnummer einzugeben"
            ],
            "points": -2,
            "nextEvent": 2,
            "nextImage": "login",
            "nextEventText": 1,
            "image": "mouseAction",
            "feedback": "Verdächtige Links sollten nicht geöffnet werden"
          }
        ]
      },
      "1": {
        "_id": "6268ddd6b055e86ede854ae8",
        "name": "event2",
        "text": [
          "Sie haben eine neue E-Mail/Antwort erhalten und den Link geöffnet, wählen Sie nun aus, was Ihr nächster Schritt ist.",
          "Sie haben den Link geöffnet, wählen Sie nun aus, was Ihr nächster Schritt ist.",
          "Die IT-Abteilung hat Ihnen dringend davon abgeraten, sich anzumelden. Sie haben jedoch später im Browser gesehen, dass eine Datei automatisch heruntergeladen wurde ohne dass Sie dafür etwas tun."
        ],
        "levelId": "6268de6cb055e86ede854aed",
        "cards": [
          {
            "_id": "6268dec7b055e86ede854af3",
            "name": "card5",
            "text": [
              "Seite schließen, noch einmal versuchen und schauen, ob beim zweiten Seitenaufruf auch eine Anmeldung erforderlich ist"
            ],
            "points": -1,
            "nextEvent": 3,
            "nextImage": "download",
            "nextEventText": 0,
            "image": "mouseAction",
            "feedback": "Die Eingabe von Zugangsdaten in unbekannten Seiten ist nicht sicher"
          },
          {
            "_id": "6268ded8b055e86ede854af4",
            "name": "card6",
            "text": [
              "Sich anmelden"
            ],
            "points": -2,
            "nextEvent": 3,
            "nextImage": "download",
            "nextEventText": 1,
            "image": "encryption",
            "feedback": "Die Eingabe von Zugangsdaten in unbekannten Seiten ist nicht sicher"
          },
          {
            "_id": "6268def9b055e86ede854af6",
            "name": "card7",
            "text": [
              "Mit der IT-Abteilung Kontakt aufnehmen und fragen, warum man sich anmelden soll."
            ],
            "points": 1,
            "nextEvent": 3,
            "nextImage": "download",
            "nextEventText": 2,
            "image": "humanInterface",
            "feedback": "Kontaktaufnahme mit der IT-Abteilung bei Unklarheiten ist eine gute Entscheidung"
          }
        ]
      },
      "2": {
        "_id": "6268dde8b055e86ede854ae9",
        "name": "event3",
        "text": [
          "Nachdem Sie die Seite noch einmal geöffnet hatten, haben Sie im Browser gesehen, dass eine Datei automatisch heruntergeladen wurde ohne dass Sie dafür etwas tun.",
          "Sie haben im Browser gesehen, dass eine Datei automatisch heruntergeladen wurde, ohne dass Sie dafür etwas tun.",
          "Die IT-Abteilung hat Ihnen dringend davon abgeraten, sich anzumelden. Sie haben jedoch später im Browser gesehen, dass eine Datei automatisch heruntergeladen wurde ohne dass Sie dafür etwas tun.",
          "Die Sicherheitsabteilung überprüft aktuell den Fall. Währendessen hat Ihre Arbeitskollegin, die mit Ihnen im selben Büro arbeitet, den Link geöffnet und bittet Sie um Hilfe. Sie haben im Browser der Arbeitskollegin gesehen, dass eine Datei automatisch heruntergeladen wurde ohne dass sie dafür etwas tut.",
          "Nachdem Sie die E-mail gelöscht hatten, hat Ihre Arbeitskollegin, die mit Ihnen im selben Büro arbeitet, den Link geöffnet und bittet Sie um Hilfe. Sie haben im Browser der Arbeitskollegin gesehen, dass eine Datei automatisch heruntergeladen wurde ohne dass sie dafür etwas tut."
        ],
        "levelId": "6268de6cb055e86ede854aed",
        "cards": [
          {
            "_id": "6268df0db055e86ede854af7",
            "name": "card8",
            "text": [
              "Datei öffnen"
            ],
            "points": -2,
            "nextEvent": 4,
            "nextImage": "ransomware",
            "nextEventText": 0,
            "image": "mouseAction",
            "feedback": "Heruntergeladene Dateien von unbekannten Webseiten sollten niemals geöffnet werden"
          },
          {
            "_id": "6268df1bb055e86ede854af8",
            "name": "card9",
            "text": [
              "Datei löschen"
            ],
            "points": -1,
            "nextEvent": 5,
            "nextImage": "ransomware",
            "nextEventText": 0,
            "image": "deleted",
            "feedback": "Heruntergeladene Dateien von unbekannten Webseiten können Schaden anrichten, auch wenn sie nicht geöffnet wurden"
          },
          {
            "_id": "6268df2fb055e86ede854af9",
            "name": "card10",
            "text": [
              "Programmiermodus von allen Schlüsselschaltern der Sicherheitssteuerung beenden"
            ],
            "points": 4,
            "nextEvent": 6,
            "nextImage": "ransomware",
            "nextEventText": 0,
            "image": "technical",
            "feedback": "Programmiermodus zu beenden ist eine gute Reaktion, um zu versuchen, den Angriff zu stoppen"
          }
        ]
      },
      "3": {
        "_id": "6268ddfdb055e86ede854aea",
        "name": "event4",
        "text": [
          "Die Datei enthält eine Malware, die Stuxnet heißt und sich auf Angriffe auf Systeme zur Überwachung und Steuerung spezialisiert. Da das Sicherheitssteuerungssystem währenddessen mittels eines Schlüsselschalters im Programmier-Modus belassen war, ist den Angreifern gelungen, Sicherheitsfunktionen des Systems zu deaktivieren."
        ],
        "levelId": "6268de6cb055e86ede854aed",
        "cards": [
          {
            "_id": "6268df2fb055e86ede854af9",
            "name": "card10",
            "text": [
              "Programmiermodus von allen Schlüsselschalters der Sicherheitssteuerung beenden"
            ],
            "points": 4,
            "nextEvent": 6,
            "nextImage": "ransomware",
            "nextEventText": 0,
            "image": "technical",
            "feedback": "Programmiermodus zu beenden ist eine gute Reaktion, um zu versuchen, den Angriff zu stoppen"
          }
        ]
      },
      "4": {
        "_id": "6285ef85acfba4ccaa3aef76",
        "name": "event5",
        "text": [
          "Die Datei enthielt eine Malware, die Stuxnet heißt und sich auf Angriffe auf Systeme zur Überwachung und Steuerung spezialisiert. Da das Sicherheitssteurungssystem währenddessen mittels eines Schlüsselschalters im Programmier-Modus belassen war, ist den Angreifern gelungen, Sicherheitsfunktionen des Systems zu deaktivieren"
        ],
        "levelId": "6268de6cb055e86ede854aed",
        "cards": [
          {
            "_id": "6268df2fb055e86ede854af9",
            "name": "card10",
            "text": [
              "Programmiermodus von allen Schlüsselschalters der Sicherheitssteuerung beenden"
            ],
            "points": 4,
            "nextEvent": 6,
            "nextImage": "ransomware",
            "nextEventText": 0,
            "image": "technical",
            "feedback": "Programmiermodus zu beenden ist eine gute Reaktion, um zu versuchen, den Angriff zu stoppen"
          }
        ]
      },
      "5": {
        "_id": "6285efdcacfba4ccaa3aef77",
        "name": "event6",
        "text": [
          "Da die Datei eine Stuxnet-Malware enthält, hat sie anscheinend die Sicherheitsfunktionen des Systems deaktiviert und Sie konnten den Programmiermodus nicht wie gewohnt beenden. ",
          "Sie haben es geschafft, den Angriff rechtzeitig zu stoppen. Auf den ersten Blick wurde die E-Mail von Ihrem Abteilungsleiter versendet. Überprüfen Sie jedoch die vollständige E-Mail-Adresse, stimmt die Domain?\nSind Sie doch dem Link gefolgt, seien Sie sehr vorsichtig, wenn Sie z. B. zur Eingabe von sensiblen Daten aufgefordert werden.\nFalls Sie den Eindruck bekommen, dass es sich um eine Phishing-Mail handelt, melden Sie den Vorfall bei der zuständigen Abteilung Ihres Unternehmens. \nAllein das Antworten auf solche Mails gibt den Angreifern das Signal, dass die Adresse in Benutzung ist.",
          "Sie haben es nicht geschafft, den Programmiermodus zu beenden. Die Angreifer konnten schädliche Funktionen auszuführen. Auf den ersten Blick wurde die E-Mail von Ihrem Abteilungsleiter versendet. Überprüfen Sie jedoch die vollständige E-Mail-Adresse, stimmt die Domain?\nSind Sie doch dem Link gefolgt, seien Sie sehr vorsichtig, wenn Sie z. B. zur Eingabe von sensiblen Daten aufgefordert werden.\nFalls Sie den Eindruck bekommen, dass es sich um eine Phishing-Mail handelt, melden Sie den Vorfall bei der zuständigen Abteilung Ihres Unternehmens. \nAllein das Antworten auf solche Mails gibt den Angreifern das Signal, dass die Adresse in Benutzung ist."
        ],
        "levelId": "6268de6cb055e86ede854aed",
        "cards": [
          {
            "_id": "6268df42b055e86ede854afa",
            "name": "card11",
            "text": [
              "Shutdown der Anlage "
            ],
            "points": 4,
            "nextEvent": 0,
            "image": "encryption",
            "feedback": "Da der Programmiermodus nicht beendbar war, war Shutdown der Anlage notwendig"
          },
          {
            "_id": "6285eee4acfba4ccaa3aef75",
            "name": "card12",
            "text": [
              "Weiterversuchen, den Programmiermodus beenden"
            ],
            "points": -2,
            "nextEvent": 0,
            "image": "technical",
            "feedback": "Dafür war es zu spät und der Angriff hat sich erweitert"
          }
        ]
      }
    },
    "maxScore": 12
  }
}